app/controllers/movies_controller.rb

  def index
	sort_selector = params[:sort_by]
	case sort_selector
	when "title"
		#sort by title
		order = {:order => "title"}
		@title_header = "hilite"
	when "release_date"
		#sort by date
		order = {:order => "release_date"}
		@release_date_header = "hilite"
	end


    #@movies = Movie.all
	@movies = Movie.find(:all, :order)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (0, 0, 0, 0, 0) ORDER BY title