app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
	sort_selector = params[:sort_by]
	@all_ratings = Movie.all_ratings
	@checked_ratings = params[:ratings]

	case sort_selector
	when "title"
		order = {:order => "title"}
		@title_header = "hilite"
	when "release_date"
		order = {:order => "release_date"}
		@release_date_header = "hilite"
	end

	if @checked_ratings == nil
		@checked_ratings = Hash[@all_ratings.map{|rating| [rating, 1]}]